// Copyright (c) 2015-2019 The HomeKit ADK Contributors
//
// Licensed under the Apache License, Version 2.0 (the “License”);
// you may not use this file except in compliance with the License.
// See [CONTRIBUTORS.md] for the list of HomeKit ADK project authors.

#ifndef HAP_BASE_H
#define HAP_BASE_H

#ifdef __cplusplus
extern "C" {
#endif

// C library header files that are also available in freestanding environments (-ffreestanding).
#include <float.h>
#include <iso646.h>
#include <limits.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#define HAP_HAS_EXTENSION(x) (x == 1)

#include "HAPBase+CompilerAbstraction.h"

#if __has_feature(nullability)
#pragma clang assume_nonnull begin
#endif

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Gets the number of elements in an array.
 *
 * - This only works before the array is passed to other C functions!
 *
 * @param      array                Array.
 *
 * @return Number of elements in the array.
 */
#define HAPArrayCount(array) ((size_t)(sizeof(array) / sizeof((array)[0])))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Returns the lesser of two comparable values.
 *
 * @param      x                    A value to compare.
 * @param      y                    Another value to compare.
 *
 * @return The lesser of @p x and @p y. If @p x is equal to @p y, returns @p x.
 */
#define HAPMin(x, y) (((x) <= (y)) ? (x) : (y))

/**
 * Returns the greater of two comparable values.
 *
 * @param      x                    A value to compare.
 * @param      y                    Another value to compare.
 *
 * @return The greater of @p x and @p y. If @p x is equal to @p y, returns @p y.
 */
#define HAPMax(x, y) (((x) <= (y)) ? (y) : (x))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Error type.
 */
HAP_ENUM_BEGIN(uint8_t, HAPError) {
    kHAPError_None,           /**< No error occurred. */
    kHAPError_Unknown,        /**< Unknown error. */
    kHAPError_InvalidState,   /**< Operation is not supported in current state. */
    kHAPError_InvalidData,    /**< Data has unexpected format. */
    kHAPError_OutOfResources, /**< Out of resources. */
    kHAPError_NotAuthorized,  /**< Insufficient authorization. */
    kHAPError_Busy            /**< Operation failed temporarily, retry later. */
} HAP_ENUM_END(uint8_t, HAPError);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * System time expressed as milliseconds relative to an implementation-defined time in the past.
 */
typedef uint64_t HAPTime;

/**
 * Time interval in nanoseconds.
 */
typedef uint64_t HAPTimeNS;

/**
 * 1 millisecond in milliseconds.
 */
#define HAPMillisecond ((HAPTime) 1)

/**
 * 1 second in milliseconds.
 */
#define HAPSecond ((HAPTime)(1000 * HAPMillisecond))

/**
 * 1 minute in milliseconds.
 */
#define HAPMinute ((HAPTime)(60 * HAPSecond))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/** Length of a MAC address. */
#define kHAPMACAddress_NumBytes ((size_t) 6)

/**
 * MAC address.
 */
typedef struct {
    /** Network byte order (big-endian). */
    uint8_t bytes[kHAPMACAddress_NumBytes];
} HAPMACAddress;
HAP_STATIC_ASSERT(sizeof(HAPMACAddress) == kHAPMACAddress_NumBytes, HAPMACAddress);

/**
 * IP address version.
 */
HAP_ENUM_BEGIN(uint8_t, HAPIPAddressVersion) { /** IPv4. */
                                               kHAPIPAddressVersion_IPv4 = 1,

                                               /** IPv6. */
                                               kHAPIPAddressVersion_IPv6
} HAP_ENUM_END(uint8_t, HAPIPAddressVersion);

/**
 * Determines whether a value represents a valid IP address version.
 *
 * @param      value                Value.
 *
 * @return true                     If the provided value is valid.
 * @return false                    Otherwise.
 */
HAP_RESULT_USE_CHECK
bool HAPIPAddressVersionIsValid(HAPIPAddressVersion value);

/**
 * Network port.
 */
typedef uint16_t HAPNetworkPort;

/**
 * Any network port.
 */
#define kHAPNetworkPort_Any ((HAPNetworkPort) 0)

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Length of a WPA/WPA2 Personal PSK.
 */
#define kHAPWiFiWPAPSK_NumBytes ((size_t) 32)

/**
 * Computes the WPA PSK from an ASCII passphrase for a SSID.
 *
 * - Passphrase must be valid.
 *
 * @param[out] psk                  WPA/WPA2 personal PSK.
 * @param      ssid                 SSID of the WPA/WPA2 personal Wi-Fi network.
 * @param      passphrase           The network's passphrase credential: 8-63 printable ASCII characters.
 */
void HAPWiFiGetWPAPSKForPassphrase(
        uint8_t psk[_Nonnull kHAPWiFiWPAPSK_NumBytes],
        const char* ssid,
        const char* passphrase);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Setup info.
 */
typedef struct {
    uint8_t salt[16];      /**< SRP salt. */
    uint8_t verifier[384]; /**< SRP verifier. */
} HAPSetupInfo;
HAP_STATIC_ASSERT(sizeof(HAPSetupInfo) == 400, HAPSetupInfo);

/**
 * NULL-terminated setup ID string (format: XXXX).
 */
typedef struct {
    char stringValue[4 + 1]; /**< NULL-terminated. */
} HAPSetupID;
HAP_STATIC_ASSERT(sizeof(HAPSetupID) == 5, HAPSetupID);

/**
 * NULL-terminated setup code string (format: XXX-XX-XXX).
 */
typedef struct {
    char stringValue[10 + 1]; /**< NULL-terminated. */
} HAPSetupCode;
HAP_STATIC_ASSERT(sizeof(HAPSetupCode) == 11, HAPSetupCode);

/**
 * NULL-terminated setup payload string.
 */
typedef struct {
    char stringValue[20 + 1]; /**< NULL-terminated. */
} HAPSetupPayload;
HAP_STATIC_ASSERT(sizeof(HAPSetupPayload) == 21, HAPSetupPayload);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Advertising interval for Bluetooth LE.
 *
 * Unit: 0.625 ms
 *
 * @see Bluetooth Core Specification Version 5
 *      Vol 2 Part E Section 7.8.5 LE Set Advertising Parameters Command
 */
typedef uint16_t HAPBLEAdvertisingInterval;

/**
 * Converts an advertising interval in milliseconds to an advertising interval for Bluetooth LE.
 *
 * @param      milliseconds         Advertising interval in milliseconds.
 *
 * @return Advertising interval for Bluetooth LE.
 */
#define HAPBLEAdvertisingIntervalCreateFromMilliseconds(milliseconds) \
    ((HAPBLEAdvertisingInterval)((milliseconds) / (0.625f)))

/**
 * Converts an advertising interval for Bluetooth LE to an advertising interval in milliseconds.
 *
 * @param      advertisingInterval  Advertising interval for Bluetooth LE.
 *
 * @return Advertising interval in milliseconds.
 */
#define HAPBLEAdvertisingIntervalGetMilliseconds(advertisingInterval) \
    ((advertisingInterval) * (0.625f * HAPMillisecond))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Fills a buffer with zeros.
 *
 * @param[out] bytes                Buffer to fill with zeros.
 * @param      numBytes             Number of bytes to fill.
 */
void HAPRawBufferZero(void* bytes, size_t numBytes);

/**
 * Copies bytes from a source buffer to a destination buffer.
 *
 * @param[out] destinationBytes     Destination buffer.
 * @param      sourceBytes          Source buffer.
 * @param      numBytes             Number of bytes to copy.
 */
void HAPRawBufferCopyBytes(void* destinationBytes, const void* sourceBytes, size_t numBytes);

/**
 * Determines equality of two buffers in constant time.
 *
 * @param      bytes                Buffer to compare.
 * @param      otherBytes           Buffer to compare with.
 * @param      numBytes             Number of bytes to compare.
 *
 * @return true                     If the contents of both buffers are equal.
 * @return false                    Otherwise.
 */
HAP_RESULT_USE_CHECK
bool HAPRawBufferAreEqual(const void* bytes, const void* otherBytes, size_t numBytes);

/**
 * Determines if a buffer contains only zeros in constant time.
 *
 * @param      bytes                Buffer to check for zeros.
 * @param      numBytes             Length of buffer.
 *
 * @return true                     If a buffer contains only zeros
 * @return false                    Otherwise.
 */
HAP_RESULT_USE_CHECK
bool HAPRawBufferIsZero(const void* bytes, size_t numBytes);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

HAP_STATIC_ASSERT(CHAR_BIT == 8, CHAR_BIT);
HAP_STATIC_ASSERT(sizeof(bool) == 1, bool);
HAP_STATIC_ASSERT(sizeof(uint8_t) == 1, uint8_t);
HAP_STATIC_ASSERT(sizeof(uint16_t) == 2, uint16_t);
HAP_STATIC_ASSERT(sizeof(uint32_t) == 4, uint32_t);
HAP_STATIC_ASSERT(sizeof(uint64_t) == 8, uint64_t);
HAP_STATIC_ASSERT(sizeof(int8_t) == 1, int8_t);
HAP_STATIC_ASSERT(sizeof(int16_t) == 2, int16_t);
HAP_STATIC_ASSERT(sizeof(int32_t) == 4, int32_t);
HAP_STATIC_ASSERT(sizeof(int64_t) == 8, int64_t);
HAP_STATIC_ASSERT(sizeof(float) == sizeof(uint32_t), float);
HAP_STATIC_ASSERT(sizeof(double) == sizeof(uint64_t), double);
HAP_STATIC_ASSERT(sizeof(size_t) <= sizeof(uint64_t), size_t);

HAP_STATIC_ASSERT('\b' == 0x8, Backspace);
HAP_STATIC_ASSERT('\f' == 0xc, FormFeed);
HAP_STATIC_ASSERT('\n' == 0xa, NewLine);
HAP_STATIC_ASSERT('\r' == 0xd, CarriageReturn);
HAP_STATIC_ASSERT('\t' == 0x9, HorizontalTab);

//----------------------------------------------------------------------------------------------------------------------

/**
 * Reads a UInt8 value from a buffer.
 *
 * @param      bytes                Buffer to read from. Must contain at least 1 byte.
 *
 * @return Value that has been read.
 */
#define HAPReadUInt8(bytes) (((const uint8_t*) (bytes))[0])

/**
 * Writes a UInt8 value to a buffer.
 *
 * @param[out] bytes                Buffer to write to. Must have space for at least 1 byte.
 * @param      value                Value to write.
